class Colors:
    BLACK = "\33[30m"
    RED = "\33[31m"
    GREEN = "\33[32m"
    BROWN = "\33[33m"
    PURPLE = "\33[35m"
    CYAN = "\33[36m"
    WHITE = "\33[37m"
    BLUE42 = "\33[38;2;16;32;96m"
    DEEP_PURPLE = "\33[38;2;54;18;72m"
    DEEP_BROWN = "\33[38;2;60;45;30m"
    CLOSED = "\33[38;2;32;16;8m"
    ENTRY = "\33[38;5;45m"
    EXIT = "\33[38;5;208m"

    RESET = "\33[0;1;37m"


class Banners:
    LEFT_BANNER = [
        " ◢◤ ◤█",
        "◢◤  ◢◤",
        "███ █◢",
        "  █   ",
        " 2026 ",
        "      ",
        "      ",
        " OPR  ",
    ]
    RIGHT_BANNER = [
        "█◥ ◥◣ ",
        "◥◣  ◥◣",
        "◣█ ███",
        "   █  ",
        " 2026 ",
        "      ",
        "      ",
        " Kero ",
    ]
    CENTER_BANNER = [
        "    ▁▁▁           ▁▁  ▁▁▁                         ▁▁           ",
        "   ╱   │         ╱  │╱  ╱▁▁▁▁▁▁▁▁▁  ▁▁▁          ╱▁╱▁▁▁  ▁▁▁▁▁▁",
        "  ╱ ╱│ │ ▁▁▁▁▁▁ ╱ ╱│▁╱ ╱ ▁▁  ╱▁  ╱ ╱ ▁ ╲ ▁▁▁▁▁▁ ╱ ╱ ▁▁ ╲╱ ▁▁  ╱",
        " ╱ ▁▁▁ │╱▁▁▁▁▁╱╱ ╱  ╱ ╱ ╱▁╱ ╱ ╱ ╱▁╱  ▁▁╱╱▁▁▁▁▁╱╱ ╱ ╱ ╱ ╱ ╱▁╱ ╱ ",
        "╱▁╱  │▁│      ╱▁╱  ╱▁╱╲▁▁▁▁╱ ╱▁▁▁╱╲▁▁▁╱       ╱▁╱▁╱ ╱▁╱╲▁▁  ╱  ",
        "                                                      ╱▁▁▁▁╱   ",
    ]
    SIGNATURE_BANNER = "   42 - orobert & kebertra - 2025"
    SIGNATURE_COLORS = "000660305555555030555555550306666"


class Panels:
    ANIM_LEFT_PANEL = [
        " Space/P : Pause            ",
        " +/-     : Speed            ",
        " C/V     : Color            ",
        " ESC/Q   : Exit             ",
    ]
    LEFT_PANEL = [
        " F       : Show path        ",
        " R       : Regenerate       ",
        " C/V     : Color            ",
        " ESC/Q   : Exit             ",
    ]
    RIGHT_PANEL = [
        " Maze size :                ",
        " 🚪 Entry  :                ",
        " 👑 Exit   :                ",
        " Perfect   :                ",
    ]


class Elements:
    LARGE_DIGITS = [
        "┏━┓╺┓ ┏━┓┏━┓╻ ╻┏━╸┏━┓┏━┓┏━┓┏━┓",
        "┃ ┃ ┃ ┏━┛ ╺┫┗━┫┗━┓┣━┓  ┃┣━┫┗━┫",
        "┗━┛╺┻╸┗━╸┗━┛  ╹┗━┛┗━┛  ╹┗━┛┗━┛",
    ]
    CLOSED_CELL = [
        "▒▒▒▒▒▒",
        "▒▒░░▒▒",
        "▒▒▒▒▒▒",
    ]
    DECO_FILL = [
        "──┘ │ ├─",
        "┌─╴ ╵ │ ",
        "│ ┌─╴ ╵ ",
        "└─┤ ┌─┐ ",
    ]


class FortyTwoBrick:
    Y = [
        "╻ ╻┏━┓",
        "┗━┫┏━┛",
        "  ╹┗━╸",
    ]
    F = [
        "██████",
        "██████",
        "██████",
    ]
    E = [
        "      ",
        "      ",
        "      ",
    ]
    D = [
        "    ▄█",
        "  ▄███",
        "▄█████",
    ]
    U = [
        "█████▀",
        "███▀  ",
        "█▀    ",
    ]
